{
  "@context": "https://schema.org",
  "@type": "FAQPage",
  "mainEntity": [
    {
      "@type": "Question",
      "name": "كيف أعرف تاريخ اليوم هجري؟",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "يمكنك معرفة تاريخ اليوم الهجري مباشرة من خلال الموقع. فقط انتقل إلى صفحة تاريخ اليوم وستجد التاريخ الهجري والميلادي معروضين بوضوح. الموقع يحدث تاريخ اليوم تلقائياً بشكل يومي."
      }
    },
    {
      "@type": "Question",
      "name": "هل تحويل التاريخ دقيق 100%؟",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "نعم، أداة تحويل التاريخ توفر دقة عالية جداً في التحويل بين التقويم الهجري والميلادي. نستخدم خوارزميات معتمدة ومطابقة للتقويم الرسمي المعتمد في المملكة العربية السعودية."
      }
    },
    {
      "@type": "Question",
      "name": "كيف أحول من ميلادي لهجري؟",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "ببساطة، أدخل التاريخ الميلادي في الحقول المخصصة (اليوم، الشهر، السنة) ثم اضغط على زر التحويل. سيظهر لك التاريخ الهجري المقابل فوراً مع اسم الشهر الهجري بالعربية."
      }
    },
    {
      "@type": "Question",
      "name": "ما الفرق بين التقويم الهجري والميلادي؟",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "التقويم الهجري قمري (يعتمد على القمر) والسنة فيه 354-355 يوم، بينما التقويم الميلادي شمسي (يعتمد على الشمس) والسنة فيه 365 يوم. لذلك السنة الهجرية أقصر بحوالي 11 يوماً."
      }
    },
    {
      "@type": "Question",
      "name": "هل الموقع مجاني؟",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "نعم، جميع خدمات الموقع مجانية بالكامل. يمكنك تحويل التاريخ، حساب العمر، الاطلاع على التقويم الهجري، ومعرفة مواقيت الصلاة بدون أي رسوم."
      }
    },
    {
      "@type": "Question",
      "name": "هل يمكنني حساب عمري بالهجري؟",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "بالتأكيد! الموقع يوفر أداة خاصة لحساب العمر بالتقويم الهجري. فقط أدخل تاريخ ميلادك وسيحسب الموقع عمرك بالسنوات والأشهر والأيام الهجرية."
      }
    },
    {
      "@type": "Question",
      "name": "هل يدعم الموقع اللغة العربية؟",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "نعم، الموقع مصمم باللغة العربية بالكامل لسهولة الاستخدام. جميع الأسماء والتواريخ والأشهر معروضة باللغة العربية."
      }
    },
    {
      "@type": "Question",
      "name": "كيف أعرف التقويم الهجري لسنة كاملة؟",
      "acceptedAnswer": {
        "@type": "Answer",
        "text": "يوفر الموقع صفحة خاصة بالتقويم الهجري السنوي. يمكنك اختيار أي سنة هجرية ومشاهدة جميع أشهرها مع التواريخ الميلادية المقابلة."
      }
    }
  ]
}
